; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_3 ?v3 - type_3 ?v1 - type_1)
 	      (pred_1 ?v7 - object ?v1 - type_1)
	      (pred_2 ?v3 - type_3 ?v2 - type_2)
	      (pred_4 ?v3 - type_3 ?v7 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v3 - type_3 ?v8 ?v4 - type_1)
       :precondition (and  (pred_3 ?v3 ?v8))
       :effect (and  (pred_3 ?v3 ?v4)
		     (not (pred_3 ?v3 ?v8))))

   (:action op_1
       :parameters (?v3 - type_3 ?v6 - object ?v5 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v5) (pred_3 ?v3 ?v5) (pred_2 ?v3 ?v2))
       :effect (and (pred_4 ?v3 ?v6 ?v2)
		    (not (pred_1 ?v6 ?v5)) 
		    (not (pred_2 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_3 ?v6 - object ?v5 - type_1 ?v2 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v6 ?v2) (pred_3 ?v3 ?v5))
       :effect (and (pred_1 ?v6 ?v5)
		    (pred_2 ?v3 ?v2)
		    (not (pred_4 ?v3 ?v6 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_08 - type_3
obj_04 obj_12 obj_03 obj_06 - type_2
obj_02 obj_05 obj_13 obj_11 - type_1
obj_01 obj_09 obj_10 - object)
(:init
(pred_3 obj_07 obj_13)
(pred_2 obj_07 obj_04)
(pred_2 obj_07 obj_12)
(pred_3 obj_08 obj_13)
(pred_2 obj_08 obj_03)
(pred_2 obj_08 obj_06)
(pred_1 obj_01 obj_05)
(pred_1 obj_09 obj_11)
(pred_1 obj_10 obj_02)
)
(:goal
(and
(pred_1 obj_01 obj_11)
(pred_1 obj_09 obj_05)
(pred_1 obj_10 obj_13)
)
)

(:constraints
  (always (not (pred_3 obj_07 obj_11)))
)
)

; plan
1. (op_2 obj_07 obj_13 obj_02)
   deleted: (pred_3 obj_07 obj_13)
   added: (pred_3 obj_07 obj_02)
   goals met: 0 of 3
2. (op_2 obj_08 obj_13 obj_11)
   deleted: (pred_3 obj_08 obj_13)
   added: (pred_3 obj_08 obj_11)
   goals met: 0 of 3
3. (op_1 obj_07 obj_10 obj_02 obj_12)
   deleted: (pred_1 obj_10 obj_02) (pred_2 obj_07 obj_12)
   added: (pred_4 obj_07 obj_10 obj_12)
   goals met: 0 of 3
4. (op_1 obj_08 obj_09 obj_11 obj_06)
   deleted: (pred_1 obj_09 obj_11) (pred_2 obj_08 obj_06)
   added: (pred_4 obj_08 obj_09 obj_06)
   goals met: 0 of 3
5. (op_2 obj_07 obj_02 obj_13)
   deleted: (pred_3 obj_07 obj_02)
   added: (pred_3 obj_07 obj_13)
   goals met: 0 of 3
6. (op_2 obj_08 obj_11 obj_05)
   deleted: (pred_3 obj_08 obj_11)
   added: (pred_3 obj_08 obj_05)
   goals met: 0 of 3
7. (op_3 obj_07 obj_10 obj_13 obj_12)
   deleted: (pred_4 obj_07 obj_10 obj_12)
   added: (pred_1 obj_10 obj_13) (pred_2 obj_07 obj_12)
   goals met: 1 of 3
8. (op_3 obj_08 obj_09 obj_05 obj_06)
   deleted: (pred_4 obj_08 obj_09 obj_06)
   added: (pred_1 obj_09 obj_05) (pred_2 obj_08 obj_06)
   goals met: 2 of 3
9. (op_1 obj_08 obj_01 obj_05 obj_03)
   deleted: (pred_1 obj_01 obj_05) (pred_2 obj_08 obj_03)
   added: (pred_4 obj_08 obj_01 obj_03)
   goals met: 2 of 3
10. (op_2 obj_08 obj_05 obj_11)
   deleted: (pred_3 obj_08 obj_05)
   added: (pred_3 obj_08 obj_11)
   goals met: 2 of 3
11. (op_3 obj_08 obj_01 obj_11 obj_03)
   deleted: (pred_4 obj_08 obj_01 obj_03)
   added: (pred_1 obj_01 obj_11) (pred_2 obj_08 obj_03)
   goals met: 3 of 3
